const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
╭▰▰【 𝐙𝐎𝐑𝐎-𝐌𝐃 】▰▰╮
┆➤ ⚙️*${settings.botName || 'ZORO MD'}*
┆➤ ⚙️*VIRSION*: *${settings.version || '1.0.0'}*
┆➤ ⚙️*BY* ${settings.botOwner || 'SAYAN'}
┆▰▰▰▰▰▰▰▰▰▰
┆ 𝗣𝗢𝗪𝗘𝗥𝗘𝗗 𝗕𝗬 𝗗𝗘𝗔𝗧𝗛𝗟𝗜𝗡𝗘 💀
┆▰▰▰▰▰▰▰▰▰▰
┆
┆╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐡𝐞𝐥𝐩 | .𝐦𝐞𝐧𝐮
┆➤ 𝐩𝐢𝐧𝐠
┆➤ 𝐚𝐥𝐢𝐯𝐞
┆➤ 𝐭𝐭𝐬 <𝐭𝐞𝐱𝐭>
┆➤ 𝐨𝐰𝐧𝐞𝐫
┆➤ 𝐣𝐨𝐤𝐞
┆➤ 𝐪𝐮𝐨𝐭𝐞
┆➤ 𝐟𝐚𝐜𝐭
┆➤ 𝐰𝐞𝐚𝐭𝐡𝐞𝐫 <𝐜𝐢𝐭𝐲>
┆➤ 𝐧𝐞𝐰𝐬
┆➤ 𝐚𝐭𝐭𝐩 <𝐭𝐞𝐱𝐭>
┆➤ 𝐥𝐲𝐫𝐢𝐜𝐬 <𝐬𝐨𝐧𝐠>
┆➤ 𝟖𝐛𝐚𝐥𝐥 <𝐪𝐮𝐞𝐬𝐭𝐢𝐨𝐧>
┆➤ 𝐠𝐫𝐨𝐮𝐩𝐢𝐧𝐟𝐨
┆➤ 𝐬𝐭𝐚𝐟𝐟 | .𝐚𝐝𝐦𝐢𝐧𝐬
┆➤ 𝐯𝐯
┆➤ 𝐭𝐫𝐭 <𝐭𝐞𝐱𝐭> <𝐥𝐚𝐧𝐠>
┆➤ 𝐬𝐬 <𝐥𝐢𝐧𝐤>
┆➤ 𝐣𝐢𝐝
┆➤ 𝐮𝐫𝐥 
┆➤ 𝐟𝐚𝐧𝐜𝐲
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐛𝐚𝐧 @𝐮𝐬𝐞𝐫
┆➤ 𝐩𝐫𝐨𝐦𝐨𝐭𝐞 @𝐮𝐬𝐞𝐫
┆➤ 𝐝𝐞𝐦𝐨𝐭𝐞 @𝐮𝐬𝐞𝐫
┆➤ 𝐦𝐮𝐭𝐞 <𝐦𝐢𝐧𝐮𝐭𝐞𝐬>
┆➤ 𝐮𝐧𝐦𝐮𝐭𝐞
┆➤ 𝐝𝐞𝐥𝐞𝐭𝐞 | .𝐝𝐞𝐥
┆➤ 𝐤𝐢𝐜𝐤 @𝐮𝐬𝐞𝐫
┆➤ 𝐰𝐚𝐫𝐧𝐢𝐧𝐠𝐬 @𝐮𝐬𝐞𝐫
┆➤ 𝐰𝐚𝐫𝐧 @𝐮𝐬𝐞𝐫
┆➤ 𝐚𝐧𝐭𝐢𝐥𝐢𝐧𝐤
┆➤ 𝐚𝐧𝐭𝐢𝐛𝐚𝐝𝐰𝐨𝐫𝐝
┆➤ 𝐜𝐥𝐞𝐚𝐫
┆➤ 𝐭𝐚𝐠 <𝐦𝐞𝐬𝐬𝐚𝐠𝐞>
┆➤ 𝐭𝐚𝐠𝐚𝐥𝐥
┆➤ 𝐭𝐚𝐠𝐧𝐨𝐭𝐚𝐝𝐦𝐢𝐧
┆➤ 𝐡𝐢𝐝𝐞𝐭𝐚𝐠 <𝐦𝐞𝐬𝐬𝐚𝐠𝐞>
┆➤ 𝐜𝐡𝐚𝐭𝐛𝐨𝐭
┆➤ 𝐫𝐞𝐬𝐞𝐭𝐥𝐢𝐧𝐤
┆➤ 𝐚𝐧𝐭𝐢𝐭𝐚𝐠 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐰𝐞𝐥𝐜𝐨𝐦𝐞 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐠𝐨𝐨𝐝𝐛𝐲𝐞 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐬𝐞𝐭𝐠𝐝𝐞𝐬𝐜 <𝐝𝐞𝐬𝐜𝐫𝐢𝐩𝐭𝐢𝐨𝐧>
┆➤ 𝐬𝐞𝐭𝐠𝐧𝐚𝐦𝐞 <𝐧𝐞𝐰 𝐧𝐚𝐦𝐞>
┆➤ 𝐬𝐞𝐭𝐠𝐩𝐩
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐦𝐨𝐝𝐞 <𝐩𝐮𝐛𝐥𝐢𝐜/𝐩𝐫𝐢𝐯𝐚𝐭𝐞>
┆➤ 𝐜𝐥𝐞𝐚𝐫𝐬𝐞𝐬𝐬𝐢𝐨𝐧
┆➤ 𝐚𝐧𝐭𝐢𝐝𝐞𝐥𝐞𝐭𝐞
┆➤ 𝐜𝐥𝐞𝐚𝐫𝐭𝐦𝐩
┆➤ 𝐮𝐩𝐝𝐚𝐭𝐞
┆➤ 𝐬𝐞𝐭𝐭𝐢𝐧𝐠𝐬
┆➤ 𝐬𝐞𝐭𝐩𝐩
┆➤ 𝐚𝐮𝐭𝐨𝐫𝐞𝐚𝐜𝐭 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐚𝐮𝐭𝐨𝐬𝐭𝐚𝐭𝐮𝐬 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐚𝐮𝐭𝐨𝐬𝐭𝐚𝐭𝐮𝐬 𝐫𝐞𝐚𝐜𝐭 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐚𝐮𝐭𝐨𝐭𝐲𝐩𝐢𝐧𝐠 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐚𝐮𝐭𝐨𝐫𝐞𝐚𝐝 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐚𝐧𝐭𝐢𝐜𝐚𝐥𝐥 <𝐨𝐧/𝐨𝐟𝐟>
┆➤ 𝐩𝐦𝐛𝐥𝐨𝐜𝐤𝐞𝐫 <𝐨𝐧/𝐨𝐟𝐟/𝐬𝐭𝐚𝐭𝐮𝐬>
┆➤ 𝐩𝐦𝐛𝐥𝐨𝐜𝐤𝐞𝐫 𝐬𝐞𝐭𝐦𝐬𝐠 <𝐭𝐞𝐱𝐭>
┆➤ 𝐬𝐞𝐭𝐦𝐞𝐧𝐭𝐢𝐨𝐧
┆➤ 𝐦𝐞𝐧𝐭𝐢𝐨𝐧 <𝐨𝐧/𝐨𝐟𝐟>
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐛𝐥𝐮𝐫 <𝐢𝐦𝐚𝐠𝐞>
┆➤ 𝐬𝐢𝐦𝐚𝐠𝐞
┆➤ 𝐬𝐭𝐢𝐜𝐤𝐞𝐫
┆➤ 𝐫𝐞𝐦𝐨𝐯𝐞𝐛𝐠
┆➤ 𝐫𝐞𝐦𝐢𝐧𝐢
┆➤ 𝐜𝐫𝐨𝐩
┆➤ 𝐭𝐠𝐬𝐭𝐢𝐜𝐤𝐞𝐫 <𝐥𝐢𝐧𝐤>
┆➤ 𝐦𝐞𝐦𝐞
┆➤ 𝐭𝐚𝐤𝐞 <𝐩𝐚𝐜𝐤𝐧𝐚𝐦𝐞>
┆➤ 𝐞𝐦𝐨𝐣𝐢𝐦𝐢𝐱 <𝐞𝐦𝐣𝟏>+<𝐞𝐦𝐣𝟐>
┆➤ 𝐢𝐠𝐬 <𝐢𝐧𝐬𝐭𝐚 𝐥𝐢𝐧𝐤>
┆➤ 𝐢𝐠𝐬𝐜 <𝐢𝐧𝐬𝐭𝐚 𝐥𝐢𝐧𝐤>
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐭𝐢𝐜𝐭𝐚𝐜𝐭𝐨𝐞 @𝐮𝐬𝐞𝐫
┆➤ 𝐡𝐚𝐧𝐠𝐦𝐚𝐧
┆➤ 𝐠𝐮𝐞𝐬𝐬 <𝐥𝐞𝐭𝐭𝐞𝐫>
┆➤ 𝐭𝐫𝐢𝐯𝐢𝐚
┆➤ 𝐚𝐧𝐬𝐰𝐞𝐫 <𝐚𝐧𝐬𝐰𝐞𝐫>
┆➤ 𝐭𝐫𝐮𝐭𝐡
┆➤ 𝐝𝐚𝐫𝐞
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐠𝐩𝐭 <𝐪𝐮𝐞𝐬𝐭𝐢𝐨𝐧>
┆➤ 𝐠𝐞𝐦𝐢𝐧𝐢 <𝐪𝐮𝐞𝐬𝐭𝐢𝐨𝐧>
┆➤ 𝐢𝐦𝐚𝐠𝐢𝐧𝐞 <𝐩𝐫𝐨𝐦𝐩𝐭>
┆➤ 𝐟𝐥𝐮𝐱 <𝐩𝐫𝐨𝐦𝐩𝐭>
┆➤ 𝐬𝐨𝐫𝐚 <𝐩𝐫𝐨𝐦𝐩𝐭>
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐜𝐨𝐦𝐩𝐥𝐢𝐦𝐞𝐧𝐭 @𝐮𝐬𝐞𝐫
┆➤ 𝐢𝐧𝐬𝐮𝐥𝐭 @𝐮𝐬𝐞𝐫
┆➤ 𝐟𝐥𝐢𝐫𝐭
┆➤ 𝐬𝐡𝐚𝐲𝐚𝐫𝐢
┆➤ 𝐠𝐨𝐨𝐝𝐧𝐢𝐠𝐡𝐭
┆➤ 𝐫𝐨𝐬𝐞𝐝𝐚𝐲
┆➤ 𝐜𝐡𝐚𝐫𝐚𝐜𝐭𝐞𝐫 @𝐮𝐬𝐞𝐫
┆➤ 𝐰𝐚𝐬𝐭𝐞𝐝 @𝐮𝐬𝐞𝐫
┆➤ 𝐬𝐡𝐢𝐩 @𝐮𝐬𝐞𝐫
┆➤ 𝐬𝐢𝐦𝐩 @𝐮𝐬𝐞𝐫
┆➤ 𝐬𝐭𝐮𝐩𝐢𝐝 @𝐮𝐬𝐞𝐫 [𝐭𝐞𝐱𝐭]
┆➤ 𝐦𝐞𝐭𝐚𝐥𝐥𝐢𝐜 <𝐭𝐞𝐱𝐭>
┆➤ 𝐢𝐜𝐞 <𝐭𝐞𝐱𝐭>
┆➤ 𝐬𝐧𝐨𝐰 <𝐭𝐞𝐱𝐭>
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐢𝐦𝐩𝐫𝐞𝐬𝐬𝐢𝐯𝐞 <𝐭𝐞𝐱𝐭>
┆➤ 𝐦𝐚𝐭𝐫𝐢𝐱 <𝐭𝐞𝐱𝐭>
┆➤ 𝐥𝐢𝐠𝐡𝐭 <𝐭𝐞𝐱𝐭>
┆➤ 𝐧𝐞𝐨𝐧 <𝐭𝐞𝐱𝐭>
┆➤ 𝐝𝐞𝐯𝐢𝐥 <𝐭𝐞𝐱𝐭>
┆➤ 𝐩𝐮𝐫𝐩𝐥𝐞 <𝐭𝐞𝐱𝐭>
┆➤ 𝐭𝐡𝐮𝐧𝐝𝐞𝐫 <𝐭𝐞𝐱𝐭>
┆➤ 𝐥𝐞𝐚𝐯𝐞𝐬 <𝐭𝐞𝐱𝐭>
┆➤ 𝟏𝟗𝟏𝟕 <𝐭𝐞𝐱𝐭>
┆➤ 𝐚𝐫𝐞𝐧𝐚 <𝐭𝐞𝐱𝐭>
┆➤ 𝐡𝐚𝐜𝐤𝐞𝐫 <𝐭𝐞𝐱𝐭>
┆➤ 𝐬𝐚𝐧𝐝 <𝐭𝐞𝐱𝐭>
┆➤ 𝐛𝐥𝐚𝐜𝐤𝐩𝐢𝐧𝐤 <𝐭𝐞𝐱𝐭>
┆➤ 𝐠𝐥𝐢𝐭𝐜𝐡 <𝐭𝐞𝐱𝐭>
┆➤ 𝐟𝐢𝐫𝐞 <𝐭𝐞𝐱𝐭>
╰──────────────➤

╭─〔 ⚙️ ᴄᴏᴍᴍᴀɴᴅ  〕─➤
┆➤ 𝐩𝐥𝐚𝐲 <𝐬𝐨𝐧𝐠>
┆➤ 𝐬𝐨𝐧𝐠 <𝐬𝐨𝐧𝐠>
┆➤ 𝐬𝐩𝐨𝐭𝐢𝐟𝐲 <𝐪𝐮𝐞𝐫𝐲>
┆➤ 𝐢𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦 <𝐥𝐢𝐧𝐤>
┆➤ 𝐟𝐚𝐜𝐞𝐛𝐨𝐨𝐤 <𝐥𝐢𝐧𝐤>
┆➤ 𝐭𝐢𝐤𝐭𝐨𝐤 <𝐥𝐢𝐧𝐤>
┆➤ 𝐯𝐢𝐝𝐞𝐨 <𝐬𝐨𝐧𝐠>
┆➤ 𝐲𝐭𝐦𝐩𝟒 <𝐥𝐢𝐧𝐤>
╰──────────────➤
O─━━━━━━━━━━━━➤

> © ........ ᴍɪɴɪ ʙᴏᴛ`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '999999999999999999@newsletter',
                        newsletterName: 'zoro MD',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '999999999999999999@newsletter',
                        newsletterName: 'zoro MD by sayan',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;